###############################################################
#  Generated by:      Cadence Encounter 09.11-s084_1
#  OS:                Linux x86_64(Host ID ee207lnx01.ecn.purdue.edu)
#  Generated on:      Tue Mar  8 21:43:19 2016
#  Command:           saveDesign lab7_layout_design.enc
###############################################################
set sdc_version 1.4
current_design lab7_layout_design
create_clock [get_ports {clk}]  -name clk -period 100 -waveform {0 50}
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {clk}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {clk}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {clk}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {clk}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {n_rst}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {n_rst}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {n_rst}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {n_rst}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {transmit}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {transmit}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {transmit}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {transmit}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {write_enable}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {write_enable}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {write_enable}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {write_enable}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {write_data[7]}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {write_data[7]}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {write_data[7]}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {write_data[7]}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {write_data[6]}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {write_data[6]}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {write_data[6]}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {write_data[6]}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {write_data[5]}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {write_data[5]}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {write_data[5]}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {write_data[5]}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {write_data[4]}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {write_data[4]}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {write_data[4]}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {write_data[4]}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {write_data[3]}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {write_data[3]}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {write_data[3]}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {write_data[3]}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {write_data[2]}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {write_data[2]}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {write_data[2]}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {write_data[2]}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {write_data[1]}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {write_data[1]}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {write_data[1]}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {write_data[1]}]
set_driving_cell -lib_cell INVX8 -rise -min [get_ports {write_data[0]}]
set_driving_cell -lib_cell INVX8 -fall -min [get_ports {write_data[0]}]
set_driving_cell -lib_cell INVX8 -rise -max [get_ports {write_data[0]}]
set_driving_cell -lib_cell INVX8 -fall -max [get_ports {write_data[0]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data[0]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {transmit}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {n_rst}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data[7]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data[5]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data[3]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data[1]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_enable}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data[6]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data[4]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {fifo_full}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {fifo_empty}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {d_minus}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {d_plus}]
